sims/controllers/TypeController.php

SELECT * FROM `sc_type` WHERE pid=0 ORDER BY convert(name using gbk)
---
    public function init(){
        parent::init();
        $function = new CommonFunction();
        $pidlist = Type::find()->where('pid=0')->orderBy('convert(name using gbk)')->asArray()->all();