sims/models/Admin.php

SELECT * FROM `sc_admin` WHERE `id`=1
---
    public static function findById($id) {
        $user = Admin::find()->where(array('id' => $id))->asArray()->one();