sims/models/Menu.php

SELECT COUNT(*) FROM `sc_menu` WHERE `parent`=0
SELECT * FROM `sc_menu` WHERE `parent`=0 ORDER BY `taxis` DESC
---
    function getSelectList($pid = 0,$str = '',$currentId = 0){
        $num = self::find()->where(['parent' => $pid])->count();
        //$obj = self::find()->where(['parent' => $pid])->orderBy(['taxis'=>SORT_DESC])->all();
        //$num = ArrayHelper::toArray($obj);
        if($num){
            $obj = self::find()->where(['parent' => $pid])->orderBy(['taxis' => SORT_DESC])->all();

SELECT COUNT(*) FROM `sc_menu` WHERE `parent`=0
SELECT * FROM `sc_menu` WHERE `parent`=0 ORDER BY `taxis` DESC
---
    function getMenuList($pid = 0,$str = '',$name = ''){
        $numObj = self::find()->where(['parent' => $pid]);
        if(strlen($name)){
            $numObj ->andFilterWhere(['like','name',$name]);
        }
        $num = $numObj->count();
        //$obj = self::find()->where(['parent' => $pid])->orderBy(['taxis'=>SORT_DESC])->all();
        //$num = ArrayHelper::toArray($obj);
        if($num){
            $rowsObj = self::find()->where(['parent' => $pid]);
            if(strlen($name)){
                $rowsObj -> andFilterWhere(['like','name',$name]);
            }
            $rows = $rowsObj->orderBy(['taxis' => SORT_DESC])->all();

SELECT * FROM `sc_menu` WHERE `parent`=0 ORDER BY `taxis` DESC
SELECT COUNT(*) FROM `sc_menu` WHERE `parent`=81
SELECT * FROM `sc_menu` WHERE `parent`=81 ORDER BY `taxis` DESC
SELECT COUNT(*) FROM `sc_menu` WHERE `parent`=82
---
    function getLeftMenu(){
        $leftMenu = [];
        $firstRows = self::find()->where(['parent'=>0])->orderBy(['taxis'=>SORT_DESC])->all();
        foreach($firstRows as $k_1 => $v_1){
            $leftMenu[$v_1->id]['id']       = $v_1->id;
            $leftMenu[$v_1->id]['name']     = $v_1->name;
            $leftMenu[$v_1->id]['parent']   = $v_1->parent;
            $leftMenu[$v_1->id]['url']      = $v_1->url;
            $leftMenu[$v_1->id]['permission'] = $v_1->getPermissionList();
            $sonCount = self::find()->where(['parent'=>$v_1->id])->count();
            if($sonCount){
                $secondRows = self::find()->where(['parent'=>$v_1->id])->orderBy(['taxis'=>SORT_DESC])->all();
                foreach($secondRows as $k_2 => $v_2){
                    $leftMenu[$v_1->id]['sons'][$v_2->id]['id']         = $v_2->id;
                    $leftMenu[$v_1->id]['sons'][$v_2->id]['name']       = $v_2->name;
                    $leftMenu[$v_1->id]['sons'][$v_2->id]['parent']     = $v_2->parent;
                    $leftMenu[$v_1->id]['sons'][$v_2->id]['url']        = $v_2->url;
                    $leftMenu[$v_1->id]['sons'][$v_2->id]['permission'] = $v_2->getPermissionList();
                    $son2Count = self::find()->where(['parent'=>$v_2->id])->count();