sims/models/PermissionForm.php

SELECT * FROM `sc_menu` WHERE `id`=35
---
    public function getMenuName(){
        $menuName = '';
        $menu = new Menu();
        $myData = $menu ->findOne($this->menu_id);